# ============= .bashrc ============= #

##==================≠==================
## Aliases
##==================≠==================
alias ls="ls -a"
alias rm='rm -rf'
alias cp='cp -i'
alias mv='mv -i'

##==================≠==================
## Source global definitions
if [ -f /etc/bashrc ]; then
        . /etc/bashrc
fi

##==================≠==================
#       ====BASH COMMANDS====

##==================≠==================
### 1.Отображение Даты и Времени 
export HISTTIMEFORMAT="%Y%m%d %H:%M [$(whoami)@$(hostname -b)]# "

##==================≠==================
### 2.Увеличиваем размер и количество строк
export HISTSIZE=50000
export HISTFILESIZE=50000

##==================≠==================
### 3.Добавл Команд Bash в Файл с Историей 
shopt -s histappend

##==================≠==================
### 4. Мгновенно Сохранять Историю 
###*    / == РАНЕЕ НЕ ЗАДАНА :
PROMPT_COMMAND='history -a'
###*    / == РАНЕЕ ЗАДАНА :
#PROMPT_COMMAND='$PROMPT_COMMAND; history -a'

##==================≠==================
## 5. Контролируйте Bash History
### HISTCONTROL — список опций, разделенных двоеточиями.
export HISTCONTROL=ignorespace:erasedups
 
##==================≠==================
## 6. Игнорировать Определенные Команды 
export HISTIGNORE="ls:ps:history"  # Не сохранять команды ls, ps и history: 

##==================≠==================
## 7. Исправление случайных ошибок.
shopt -s cdspell

##==================≠==================
## 8.все строки многостроч.,в одной записи
shopt -s cmdhist

##==================≠==================
## 9. Изменить Имя Файла с Историй Команд
export HISTFILE=~/.history_"$USER"

##==================≠==================
## Применить изменения в ~/.bashrc:
$ source ~/.bashrc